export type ProgramEntry = {
  time: string;
  title: string;
  description?: string;
};

export type ProgramDay = {
  date: string;
  entries: ProgramEntry[];
};

export const programDays: ProgramDay[] = [
  {
    date: "8 февраля",
    entries: [
      { time: "12:00 - 13:00", title: "Заезд, расселение участников" },
      { time: "13:30 - 14:30", title: "Обед" },
      {
        time: "15:30 - 16:30",
        title: "Лекция «Молодежная политика СОГУ»",
        description: "Измаил Ханаев, Елизавета Фарниева, Давид Валиев",
      },
      {
        time: "16:30 - 17:30",
        title: "Лекция «Возможности развития молодежи Северной Осетии»",
        description: "Сабина Мамаева",
      },
      { time: "17:30 - 18:00", title: "Командообразование" },
      { time: "18:00 - 19:00", title: "Ужин" },
      { time: "19:00 - 19:30", title: "Открытие" },
      { time: "19:30 - 22:00", title: "Квиз" },
      { time: "22:00 - 22:30", title: "Рефлексия" },
      { time: "23:00", title: "Отбой" },
    ],
  },
  {
    date: "9 февраля",
    entries: [
      { time: "8:30 - 9:00", title: "Зарядка" },
      { time: "9:00 - 10:00", title: "Завтрак" },
      {
        time: "10:00 - 11:30",
        title:
          "Лекция «Типы мероприятий на базе университета. Создание идеи и концепция мероприятия.»",
        description: "Фатима Бетеева, Джульетта Козаева",
      },
      {
        time: "11:45 - 13:00",
        title: "Лекция «Спортивный клуб СОГУ: путь развития»",
        description: "Анзор Макиев",
      },
      { time: "13:00 - 14:00", title: "Обед" },
      {
        time: "14:00 - 15:30",
        title:
          "Лекция «Маркетинг и медиасопровождение: как продвигать события в соцсетях»",
        description: "Лолита Созаева",
      },
      {
        time: "16:00 - 18:00",
        title: "Практикум «Разработка стратегии продвижения мероприятия»",
        description: "Лолита Созаева",
      },
      { time: "18:00 - 19:00", title: "Ужин" },
      { time: "19:30 - 22:00", title: "Вечернее мероприятие" },
      { time: "22:00 - 22:30", title: "Рефлексия" },
      { time: "23:00", title: "Отбой" },
    ],
  },
  {
    date: "10 февраля",
    entries: [
      { time: "8:30 - 9:00", title: "Зарядка" },
      { time: "9:00 - 10:00", title: "Завтрак" },
      {
        time: "10:00 - 11:00",
        title: "Лекция «Формирование команды. Распределение задач»",
        description: "Фатима Бетеева, Джульетта Козаева",
      },
      {
        time: "11:15 - 13:00",
        title:
          "Лекция «Планирование и составление сметы, оптимизация бюджета. Работа в день мероприятия. Анализ выполненных и невыполненных задач»",
        description: "Фатима Бетеева, Джульетта Козаева",
      },
      { time: "13:00 - 14:00", title: "Обед" },
      {
        time: "14:00 - 16:00",
        title: "Практикум «Создание концепции мероприятия»",
        description: "Фатима Бетеева, Джульетта Козаева",
      },
      {
        time: "16:30 - 18:00",
        title:
          "Встреча с А.Т. Кокаевым, проректором по молодежной политике и административной работе СОГУ",
      },
      { time: "18:00 - 19:00", title: "Ужин" },
      { time: "19:30 - 22:00", title: "Вечернее мероприятие" },
      { time: "22:00 - 22:30", title: "Рефлексия" },
      { time: "23:00", title: "Отбой" },
    ],
  },
  {
    date: "11 февраля",
    entries: [
      { time: "8:30 - 9:00", title: "Зарядка" },
      { time: "9:00 - 10:00", title: "Завтрак" },
      {
        time: "10:00 - 13:00",
        title: "Практикум «Завершение работы над мероприятиями»",
        description: "Фатима Бетеева, Джульетта Козаева",
      },
      { time: "13:00 - 14:00", title: "Обед" },
      {
        time: "14:00 - 15:00",
        title: "Презентация созданных концепций мероприятий",
      },
      {
        time: "15:00 - 17:00",
        title: "Подготовка к закрытию мероприятия",
      },
      { time: "18:00 - 23:00", title: "Закрытие" },
    ],
  },
  {
    date: "12 февраля",
    entries: [
      { time: "9:00 - 10:00", title: "Завтрак" },
      { time: "12:00", title: "Выезд" },
    ],
  },
];
